Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 顾粲就将事情原原本本说了遍，不否认这个孩子平时让人恨得牙痒痒，但确实聪颖早慧得很，从老槐树到铁锁井，再到泥瓶巷院子，把那个说书先生要收他为徒的奇遇，给陈平安说清楚明白了。陈平安这刻心里大致有数了，顾粲多半就是小镇上自己得到祖荫槐叶的人物之，祖坟冒青烟也好，像齐先生陆道长所说有机缘福气也罢，顾粲应该是会被那个说书先生带离小镇。但是想到那个截江真君刘志茂，陈平安就心弦紧绷，按照齐先生的说法，此人品行实在低劣，更想将自己除之后快，不惜用上了仙家神通来陷害自己和蔡金简，顾粲认了此人做师父，真是好事不过退步说，此人愿意收顾粲为徒，而不是坑蒙拐骗，或是强买强卖，是不是可以说明顾粲暂时不会有性命之忧
en_us: Gu Can recounted the events to him, from beginning to end. While this little child was truly infuriating most of the time, one had to admit that he was indeed very smart and intelligent for his young age. From the old locust tree to the Iron Lock Well, and from the Iron Lock Well to Clay Vase Alley, the little boy clearly described his encounter with the storyteller and how the storyteller had wanted to take him as a disciple. After hearing this, Chen Ping'an felt like he largely understood the situation. Gu Can was most likely someone who had obtained locust leaves with ancestral blessings. Regardless of whether this was because of fortune rising from the graves of his ancestors or because of the fated opportunities and fortunes that Mr. Qi and Daoist Lu spoke of, it was very likely the case that Gu Can would be brought out of the small town by that storyteller. However, Chen Ping'an immediately felt anxious and uneasy upon thinking of the River Severing True Lord. According to Mr. Qi, this person was extremely immoral, and he had more so tried to lead him to his death. He hadn't hesitated to use immortal techniques to create conflict between him and Cai Jinjian. Was it truly a good thing for Gu Can to become his disciple? On the other hand, however, since this person was willing to take Gu Can as a disciple, and since he didn't try to kidnap or trick him, nor forcefully buy him, could it be presumed that Gu Can wouldn't face any life-threatening dangers?

source: 顾粲意识到自己还有正事，赶紧把陈平安扯到院门口，然后将两只绣工精美的袋子，股脑塞到陈平安手里，孩子压低嗓音问道：“还记得我去年跟你要的那条小泥鳅不”
en_us: Realizing that he still had important matters to deal with, Gu Can hurriedly dragged Chen Ping'an to the entrance of his courtyard. He then stuffed two exquisitely decorated pouches into Chen Ping'an's hands, lowering his voice and saying, "Remember the small loach you gave me last year?"

source: 顾粲抽了抽鼻子，使劲点头。
en_us: Gu Can sniffed before earnestly nodding in response.

source: 顾粲搬来一条小板凳，自顾自坐下，跟娘亲和老人，呈现出三足鼎立之势。孩子双手托起腮帮，“娘，你刚才和说书先生到底说了啥，我在屋里头听不清楚，你们再说说呗？”
en_us: He carried over a little stool for himself before taking a seat on it, forming a triangle with his mother and the River Severing True Lord. He then rested his chin on his hands as he asked, "What did you and the storyteller speak about just now? I couldn't hear you clearly from inside the room, can you repeat what you said earlier?"

source: 顾粲正要发挥下家传本事，察觉到自己脑袋上的手掌，悄悄加重了力道，立即病恹恹的，有气无力道：“姐姐你长得这么水灵，说啥都对。”
en_us: Gu Can was just about to unleash his immense talent, yet he suddenly felt the hand on his head pressing down even harder. He immediately wilted under the pressure, saying in a listless manner, "Sister, you're so beautiful. Of course everything you say is correct."

source: 顾粲犟脾气也上来了，“就不”
en_us: Gu Can's stubborness also showed itself at this moment, and he retorted, "No!"

source: 顾粲猛然间觉得脑壳阵生疼，赶紧转身望去，看到那张熟悉面孔后，孩子破口大骂道：“陈平安你大爷的”
en_us: Gu Can suddenly felt a dull pain on the back of his head. He hurriedly turned around, and after seeing that familiar face, he let loose again, shouting, "Chen Ping'an, you bloody little thing!"

source: 顾粲眼珠子转，刚想骗人，陈平安跟他关系实在是再熟悉不过，小王蛋撅起屁股就知道拉什么屎，直接又赏了顾粲个板栗，厉色道：“拿回去”
en_us: Gu Can's eyes darted around, and he was just about to make up a story. However, Chen Ping'an was far too familiar with him, so much so that he could immediately see through his thoughts. He directly rewarded Gu Can with a rap on the head before saying sternly, "Take it back."

source: 顾粲眼睛亮，赶紧把两条鼻涕擦掉，咧着嘴，露出缺牙的光景，笑脸谄媚道：“姐姐你长得真俊，长得跟我家二姐模样这里地方小，去我家坐坐”
en_us: Gu Can's eyes lit up at this moment, and he hurriedly wiped the two lines of snot from his face. He cracked an obsequious smile, revealing his missing baby teeth as he said, "Sister, you're so pretty! You look just like my second sister! This place is too cramped, so why don't you come to my house to chat?"

source: 顾粲突然在他耳畔窃窃私语。
en_us: Gu Can suddenly whispered something next to his ears.

source: 顾粲突然身体前倾，使劲用脑门磕了下陈平安的脑袋，呜咽道：“对不起”
en_us: Gu Can suddenly fell forward, and his head heavily clashed together with Chen Ping'an's. He whimpered and said, "Sorry."

source: 顿时笑声震天。
en_us: A chorus of raucous laughter instantly rang out.

source: 颤颤巍巍，风景这边独好。
en_us: As she did so, a certain pair of monuments quivered under her clothes, presenting an alluring sight to behold.

source: 风尘仆仆的少女咧嘴一笑，双手环胸，英姿勃发，道：“我觉得应该跟你说一声再见，所以我来了。”
en_us: The slightly disheveled young woman had her arms crossed, and she grinned at Chen Ping'an as she declared, "I felt like it was only right for me to bid you farewell, so I came."

source: 风雷园年轻一辈第一人的刘灞桥，呆若木鸡。
en_us: A wave of relief instantly washed over Cui Minghuang and Chen Songfeng, while Liu Baqiao was completely rooted to his chair with a stunned expression.

source: 风雷园年轻剑修一看到少年少女，立即神采飞扬，对宁姚所说第一句话就是，“小姑娘，你年纪再大一些，肯定不比我家苏仙子差。”
en_us: Liu Baqiao glowed with exuberance when he saw Chen Ping'an and Ning Yao, and his first comment to the latter was, "Young lady, when you grow older, you definitely won't be any less beautiful than Celestial Maiden Su."

source: 风雷园有七境八境武夫各有一人，而且与刘灞桥关系都不错。
en_us: The Wind Lightning Field had a single seventh tier martial artist and a single eighth tier martial artist, and both of them were quite close with Liu Baqiao.

source: 风雷园，正阳山。
en_us: When it came to the Wind Lightning Field and the Suns Sorch Mountain, there was often no catalyst required at all for a battle to break out between members of the two opposing sects, whether that be between the most revered sword immortals of the two sects, or new disciples that had only just joined the sects.

source: 飞剑下坠的速度快如闪电，轨迹上，拉扯出一条连绵不绝的云尾。
en_us: The flying sword descended as fast as lightning, leaving a continuous cloud trail in its wake.

source: 飞剑凌空悬停，剑尖距离年轻道人的眉心，不过三寸。
en_us: All of a sudden, the flying sword hurtled directly toward him, stopping no more than three inches away from his glabella.

source: 飞剑剑尖所指，则是沉默不言的正阳山搬山猿，浑身上下，隐隐散发出一言不合就要分生死的暴躁气势。
en_us: The flying sword was pointing at the silent Bai Yuan, the Mountain-moving Ape from Sun Scorch Mountain. He was radiating with an irascible aura at this moment, and it was as if he were about to leap into a life-and-death battle at any moment.

source: 飞剑好似在犹豫，剑尖微微颤抖。
en_us: The tip of the flying sword was trembling slightly, as it were hesitating about how to proceed.

source: 飞剑并未入鞘，而是环绕少女四周，飞快旋转，邀功讨好主人。
en_us: The flying sword didn't return to its sheath, and it instead flew around Ning Yao as if it were trying to ask for praise and also please her.

source: 飞剑眨眼间便消失不见。
en_us: The flying sword vanished in the blink of an eye, leaving the Daoist priest to murmur to himself alone in a furious voice, "There have to be mutual feelings for a relationship to blosom, yet that bastard, Qi Jingchun, is going around assigning couples as he pleases without any regard for the consequences!"

source: 飞剑瞬间穿透齐静春法相的手臂，在距离地面只有咫尺之遥的时候，骤然停止。
en_us: The sword instantly pierced through the arm of Qi Jingchun's Dao Manifestation, then drew to an abrupt halt mere inches away from the ground.

source: 飞剑身边站着一个风尘仆仆的中年儒士，双鬓霜白更胜，若是赵繇、宋集薪两位读书种子在场，就会发现短短一旬时光，这位学塾先生的白发已经多了许多。
en_us: There was a slightly disheveled middle-aged scholar standing in front of the sword, and both of his sideburns had already become as white as frost. If Zhao Yao or Song Jixin were present, they would discover that their master's hair had grayed significantly in just a mere 10 days.

source: 马上要进山了，陈平安停下脚步，陈对几乎同时就开口说道：“刘灞桥，告诉他，只管带路，越快越好。”
en_us: They were about to enter the mountains soon, and Chen Ping'an stopped and was just about to turn around. However, Chen Dui said at almost the exact same moment, "Liu Baqiao, tell him that he only needs to worry about leading the way. The quicker the better."

source: 马尾辫少女皱眉问道：“爹？”
en_us: The young girl with a ponytail frowned and asked, "Dad?"

source: 马苦玄一路跑回那条熟悉至极的巷弄， 当他看到院门大开的时候，可谓胆大包天的少年竟然在门外停步，再也不敢跨过门槛。
en_us: Ma Kuxuan ran back to that extremely familiar alley. When he saw that the courtyard door was wide open, the courageous young boy surprisingly came to a stop. He didn't dare to walk inside.

source: 马苦玄不愿再听此人说话，站起身狞笑道：“屠城灭国做不得，滥杀无辜做不得，这些事情做不得，那些事情做不得！那么报仇杀人，到底做不做得？！”
en_us: Ma Kuxuan immediately cut him off, unwilling to listen to his reasonings any longer. He stood up with a baleful expression, and he spat, "I'm not allowed to destroy nations and massacre cities, and I'm not allowed to wantonly kill innocent people either. I'm not allowed to do this, and I'm not allowed to do that... So tell me, am I allowed seek revenge and kill my enemy?!"

source: 马苦玄乐呵呵道：“你又不是我媳妇，担心这个做啥。”
en_us: Ma Kuxuan smiled and said, "You're not my wife or anything, so there's no need for you to worry about this."

source: 马苦玄仍是没能来得及丢出石子，按理来说，大势已去。
en_us: Ma Kuxuan didn't have enough time to throw another stone. Logically speaking, he had already lost his best opportunity.

source: 马苦玄伸出一只脚，踩在女子额头上，凝视着那张晕乎乎的脸庞，弯腰低头，用雅言官话说道：“我知道凶手不在小镇了，但是没有关系，我自己可以查。”
en_us: Ma Kuxuan raised a foot and stomped on the woman's forehead. He bent over and looked down, gazing at her dazed face as he said using the official dialect, "I know the assailant isn't the small town anymore. However, this doesn't matter. I can investigate things myself."

source: 马苦玄伸手抹去满脸雨水，突然问道：“我们这座小镇，对那些外人来说算什么？”
en_us: As Ma Kuxuan wiped the rainwater from his face, he suddenly asked, "What's our small town like in the eyes of those outsiders?"

source: 马苦玄刚要说话，男人漠然道：“死人更没资格跟活人撂狠话。”
en_us: Ma Kuxuan was just about to speak, yet the man immediately cut him off with a cold expression, saying, "Dead people don't have the right to threaten living people."

source: 马苦玄刹那间脸色苍白，疯了一般跟着屋顶上的野猫一起狂奔。
en_us: Ma Kuxuan's face instantly became as pale as a sheet, and he furiously sprinted after the wild cat on the rooftops as if he had gone mad.

source: 马苦玄咧咧嘴，揉了揉肚子，眼神炙热，对陈平安大声笑道：“陈平安！敢不敢再来？！”
en_us: Ma Kuxuan grimaced as he rubbed his stomach. There was fervor in his eyes, and he roared with laughter as he said, "Chen Ping'an! Dare to exchange another blow?!"

source: 马苦玄咧嘴，“我对爹娘实在没啥感情，只有奶奶放心不下，她又不愿意跟我一起去真武山，说她这辈子是一定要葬在爷爷坟旁边的，若是去了那啥不知道几万里之外的真武山，一来要劳烦我这个孙子搬个坛子回家一趟，二来她听说人死之后，入土之前的阳间路，会走得极为坎坷，她说活着的时候已经吃够苦头了，可不想死了之后还要吃苦。”
en_us: Ma Kuxuan grinned and said, "I truly don't have any feeling toward my father and mother. However, I can't help but worry about my grandma. She's not willing to come to True Martial Mountain with me, and she said that she definitely has to be buried next to grandpa when she passes away. So, if she goes to the distant True Martial Mountain, she'll definitely have to burden me with a trip back to the small town in the future. Moreover, she heard others say that one would have to traverse a difficult Yang Path after they died, and she certainly didn't want to experience this after experiencing so many hardships while still alive."

source: 马苦玄哪怕深陷绝境，虽然惊惧异常，却没有丝毫放弃的心境，艰难扭转身躯，哪怕只有一丝一毫，也要让自身要害偏离那刀尖。
en_us: Ma Kuxuan was facing a perilous situation, and he was gripped with a sense of extreme shock and fear. However, he didn't have any intention of giving up. He twisted his body with great difficulty, determined to protect his vitals from the fast approaching blade.

source: 马苦玄嘴角扯起，笑意玩味，左手松开，丢掉剩余石子，抬起的右手本就握拳，所以顺势就是一拳砸出去。
en_us: The corners of Ma Kuxuan's mouth curled up into a smile as he unclenched his left hand and discarded the remaining stones. His right hand was already clenched into a fist, so he immediately stepped forward and threw a punch.

source: 马苦玄在这种事关生死的紧要关头，后撤一步，再次挥动手臂。
en_us: In this moment of life and death, Ma Kuxuan took a step back and swung his arm.

source: 马苦玄头也不转，“取回咱们兵家信物了？”
en_us: Without turning around, Ma Kuxuan said, "You've retrieved our Martial Sect's subjugation treasure?"

source: 马苦玄对这些不感兴趣，转头望去，看到那个撑伞男子蹲在女子身边，应该是在好言安慰安慰。
en_us: Ma Kuxuan wasn't interested in these matters, and he turned around to look at the elegant young man. Still holding the oil-paper umbrella, he was squatting down next to the young girl, and he was most likely speaking gentle words to comfort her.

source: 马苦玄强忍住眼泪，不断深呼吸，放缓脚步，轻轻喊道：“奶奶？”
en_us: Ma Kuxuan forcefully held back tears, and he took deep breaths as he slowed down his footsteps. "Grandma?" he called softly.

source: 马苦玄得势不饶人，继续前冲。
en_us: Ma Kuxuan didn't relent, and he continued to charge forward.

source: 马苦玄微微一愣，好像是完全没想到这对少年少女，如此好说话，竟然还真跟自己做起了生意。
en_us: Ma Kuxuan faltered slightly, and it was as if he hadn't imagined that Chen Ping'an and Ning Yao would be so open to negotiation. To his surprise, they were genuinely trying to make a deal with him.

source: 马苦玄微微转移视线，对陈平安咧嘴笑道：“昨天屋顶一战，很精彩，我凑巧都看见了。哦对了，你可以摘掉绑在小腿上的沙袋了，要不然你是追不上我的。”
en_us: Ma Kuxuan shifted his gaze slightly, cracking a grin at Chen Ping'an and saying, "Your battles on the rooftops yesterday was enthralling. I managed to witness it by coincidence. Oh, that's right, you can remove the pouches of sand on your legs now. Otherwise, you won't be able to catch up to me."

source: 马苦玄愤怒道：“如果不是那娘们偷偷给了他一把刀，我会输给陈平安？！我从头到尾，就只出了七分力气！如果不是觉得要玩一下猫逮耗子……”
en_us: "If Chen Ping'an hadn't pulled out a fucking dagger, how could I have lost to him?!" Ma Kuxuan replied indignantly. "From the beginning to the end, I only used 70% of my strength! If I wasn't trying to toy with him..."

source: 马苦玄握有剩余石子的左手轻轻一甩，其中一颗石子刚好落入右手手心。
en_us: Ma Kuxuan flicked his left hand where he held the remaining stones, tossing one of them into his right hand.

source: 马苦玄撇撇嘴，脸色冷漠，不摇头不反驳，却也不点头不答应。
en_us: Ma Kuxuan pursed his lips, a cold expression on his face. He didn't shake his head and talk back, but he didn't nod his head and agree either.

source: 马苦玄收回视线，与负剑男子并肩而行，少年脚步沉重，返回杏花巷。
en_us: Ma Kuxuan retracted his gaze and walked side-by-side with the swordsman. His footsteps were heavy as he returned to Apricot Blossom Alley.

source: 马苦玄时常也会蹲在青牛背上，用石子去砸水中游鱼。不管能否击中游鱼，反正少年丢入水中的石子，几乎没有水花。
en_us: Ma Kuxuan would often squat on top of the Azure Cow Ridge as well, using stones to strike the fish in the water. Regardless of whether these stones hit their target or not, they would almost never cause a spash.

source: 马苦玄最后吐了一口唾沫在女子脸上。
en_us: In the end, Ma Kuxuan spat on the young woman's face.

source: 马苦玄望向宁姚，笑道：“放心，那头老猿暂时有点事情要处理，我就趁着这个机会，想跟你讨要一样东西，你知道是什么的，对不对？”
en_us: Ma Kuxuan looked at Ning Yao and said with a smile, "Don't worry, that old ape has something to deal with right now. Taking this opportunity, I wanted to ask you for something. You already know what it is, am I right?"

source: 马苦玄死死抿起嘴唇，果真低头不语。
en_us: Ma Kuxuan tightly pursed his lips. However, he really did lower his head and remain silent.

source: 马苦玄没好气道：“你不管怎么吹捧正阳山，也改变不了真武山不如正阳山的事实。”
en_us: "No matter how much you talk up Sun Scorch Mountain, that still won't change the fact that True Martial Mountain is inferior to them!" Ma Kuxuan snapped.

source: 马苦玄犹豫不决，对比陈平安的一往无前，形成鲜明对比。
en_us: There was a clear juxtaposition between Ma Kuxuan's hesitation and Chen Ping'an's resoluteness.

source: 马苦玄率先发力，最初所站位置被踩出两个泥坑。
en_us: Ma Kuxuan dashed forward first, with his explosive power so great that he left two pits where he had stood just then.

source: 马苦玄痴痴转头望去。
en_us: Ma Kuxuan looked over in a trance.

source: 马苦玄的直觉告诉自己，那个撑伞的家伙，其实就在等自己杀了脚边的女子。
en_us: Ma Kuxuan's instinct told him that the young man with the umbrella was actually waiting for him to kill the young woman.

source: 马苦玄的身体在空中翻滚一圈，落地后继续狞笑着前冲，很快就飞奔至才半蹲起身的陈平安身前，马苦玄就是一脚。
en_us: Ma Kuxuan tumbled in the air before landing on his feet and continuing to dash forward with a wicked smile. He arrived before the half squatting Chen Ping'an in no time, and he immediately launched another kick.

source: 马苦玄皱眉道：“这个人，跟学塾齐先生给人的感觉，很不一样。”
en_us: Ma Kuxuan frowned and observed, "The feeling that he gives off is very different from the feeling the Mr. Qi gives off."

source: 马苦玄看到一个熟悉的瘦弱身影倒在地上。
en_us: Ma Kuxuan saw a familiar figure, that skinny and feeble figure, lying on the ground.

source: 马苦玄眼神熠熠，哈哈笑道：“原来你也不傻嘛，也对，跟我差不多，是yi路人。”
en_us: There was a glimmer in his eyes, and he roared with laughter as he said, "As it turns out, you're not stupid either, huh? That makes sense. You're quite similar to me, and we're actually the same type of person."

source: 马苦玄神情一滞。
en_us: Ma Kuxuan's expression faltered.

source: 马苦玄神色自若，望向刀鞘剑鞘皆空的外乡少女，笑道：“说好了，现在是我和陈平安单挑，按照我奶奶小时候讲的故事，在演义小说上，两名大将于阵前捉对厮杀，谁喊帮手谁就不是英雄好汉，若是能够阵斩敌人，军心大振，一场仗就算赢了……”
en_us: Ma Kuxuan appeared calm and composed as he looked at the young girl from the outside world whose sword and saber scabbards were both empty at this moment. He smiled and said, "Let me get this straight first. This is a battle between me and Chen Ping'an, and based on the stories that my grandma used to tell me when I was little, generals shouldn't call their underlings for help when they're duelling one-on-one. Whoever calls for reinforcements is a coward. If a general can slay their foe, then they'll greatly increase the morale of their side and they would have essentially won the battle..."

source: 马苦玄突然嗤笑道道：“杀不杀人，如何杀人，我问你作甚，难不成还需要你帮忙不成！差点忘了，我现在还不是正式的真武山弟子！”
en_us: Ma Kuxuan suddenly chuckled and sneered, "Why would I ever ask you about whether I can kill someone or how I should kill someone? Do you think I'll ever need you help?! I almost forgot... I'm still not an official disciple of True Martial Mountain yet!"

source: 马苦玄突然蹲下身，那个女子试图逃避，被浑身湿漉漉的少年一把按住脖子，在女子不敢动弹之后，少年松开手，用手掌一下一下拍打着女子的脸颊，笑道：“记住喽，我叫马苦玄，以后我一定会去找你的。还有那个不在小镇的家伙，你一定要好好感谢他，要不然我们关系也不会这么好。”
en_us: Ma Kuxuan suddenly squatted down. The young woman attempted to escape, yet her neck was instantly held down by the soaked young boy. Only after she stopped moving did he let go of her. He lightly slapped her face again and again as he smiled and said, "Remember this okay? My name is Ma Kuxuan, and I'll definitely looked for you again in the future. And also that person who isn't in the small town anymore. You definitely have to thank him well. Otherwise, the relationship between us wouldn't have been so great."

source: 马苦玄突然问道：“奶奶，泥瓶巷陈平安他爹，是不是死在”
en_us: Ma Kuxuan suddenly asked, "Grandma, did Chen Ping'an's father die in..."

source: 马苦玄笑容灿烂，不知道是觉得有道理，还是认为滑稽可笑。
en_us: Ma Kuxuan wore a dazzling smile, and it was hard to say whether this was because he agreed with his grandma or because he thought her words were farcical.

source: 马苦玄笑问道：“奶奶，你在咱们小镇当了这么多年的神婆，杏花巷的街坊邻居，人人都说你老人家能跨过阴阳之隔，接引亡魂回到阳间”
en_us: Ma Kuxuan smiled and said, "Grandma, you've been the sorceress of our small town for so many years, and our neighbors in Apricot Blossom Alley all praise you and say that you can overcome the gap between yin and yang and bring ghosts back to the living world."

source: 马苦玄红着眼睛走入院子，正屋大门也没有关。
en_us: The rims of Ma Kuxuan's eyes were red as he walked into the courtyard. The door to the house was also open.

source: 马苦玄缓缓站起身，起身前少年抓了抓一丛杂草，随意擦去手心血迹。
en_us: Ma Kuxuan slowly stood up, grabbing a handful of weeds as he did so. He then casually wiped away the blood on his palm.

source: 马苦玄脸色冷漠地收回视线后，转身走入屋内，坐在那具冰冷尸体旁边，伸手抓住老妪的干枯手掌，死死盯着她那张脸庞，少年长久不说话。
en_us: Ma Kuxuan wore a cold expression as he retracted his gaze. He turned around and walked inside the house, sitting down next to the ice-cold corpse of his grandma. He reached over and grabbed her dry and shriveled hand, and he stared intently at her face, remaining silent for a long time.

source: 马苦玄脸色狰狞，仰起头对着那尊神将咆哮道：“我不管你用什么法子，快去给我把奶奶的魂魄找回来！”
en_us: Ma Kuxuan's face contorted in fury, and he looked up at the deity and roared, "I don't give a crap what method you use! Hurry up and find my grandma's soul for me!"

source: 马苦玄身形一拧，左手闪电挥向女子脖颈，比他个头还要高出半个脑袋的修行女子，砰然一声，就被少年这一臂砸得扑倒在地。
en_us: With a twist of his body, he immediately threw a swinging arm at the woman's neck with his left arm. With a bam, the young cultivator who was half a head taller than him was sent crashing into the ground.

source: 马苦玄轻轻跳下神像，瞥了眼一袭墨绿长袍的英气少女，自言自语道：“本来以为好歹等我出了小镇，才会遇到第一位大道之敌，没想到这么快就碰上。哈哈，真是运气来了挡都挡不住啊。”
en_us: Ma Kuxuan deftly jumped down from the statue, and he took a glance at the young girl in green before muttering to himself, "I thought I would only come across my first Dao enemy after leaving the small town. Who knew I would meet one so quickly? Haha, I truly can't stop my good fortune!"

source: 马苦玄这次根本来不及出拳，就被陈平安用肩头撞在胸口，马苦玄踉跄后退，腹部又传来一阵绞痛，本能地低头弯腰，左耳太阳穴那边就被陈平安用手臂横扫而中，势大力沉，之前占尽上风的杏花巷少年，以一种诡谲姿势双脚腾空侧飞出去。
en_us: Ma Kuxuan didn't even have the time to throw a punch as Chen Ping'an thrust his shoulder into his chest. Ma Kuxuan stumbled back, with another bout of agonizing pain traveling over from his stomach. He instinctively bent over, yet his left temple was immediately struck by Chen Ping'an's swinging forearm, the force of the strike so great that he was sent flying in a peculiar manner, with his feet trailing behind his body as he flew sideways.

source: 马苦玄那条胳膊竟然出现微妙的停顿，手腕一抖，目标正是偏离直线的陈平安。
en_us: Ma Kuxuan's elbow surprisingly paused for a moment, and with a flick of his wrist, a stone shot toward the turning Chen Ping'an.

source: 马苦玄问道：“以前外乡人来此历练寻宝，淹死过人吗？”
en_us: "When coming here to train and search for treasures, have any of the outsiders drowned before?" Ma Kuxuan asked.

source: 马苦玄颤颤巍巍伸出一只手，用手背轻轻贴着他奶奶的脸颊，高高肿起，已经呈现出乌青色。
en_us: Ma Kuxuan shakily reached over, and he gently stroked his grandma's cheek with the back of his hand. Her cheek was severely swollen, and it had already become black and blue in color.

source: 马车临近泥瓶巷的时候，宋集薪有意无意道：“陈平安，真的就只是陈平安？”
en_us: When the carriages approached Clay Vase Alley, Song Jixin asked, "Is Chen Ping'an really just Chen Ping'an?"

source: 马车缓缓行驶起来。
en_us: His carriage slowly trundled forward.

source: 马车进不去小巷，宋长镜也不愿下车，宋集薪独自下车，发现下雨了，目前仍是春雨淅沥，细雨朦胧，但是有越下越大的趋势。
en_us: The carriages couldn't enter the small alley, nor did Song Changjing want to disembark to enter. Thus, Song Jixin jumped off the carriage alone. He discovered that it was raining, though this was only a light spring drizzle. However, it was showing an inclination of becoming a downpour.

source: 马车骤然而停，没过多久，宋集薪气急败坏地冲进车厢，满脸愤怒道：“你什么意思？！”
en_us: However, it suddenly ground to a halt, and after a short while, a flustered and angry Song Jixin charged into the carriage, shouting, "What's the meaning of this?!"

source: 驶出福禄街后，道路不平，宋集薪身体开始跟随马车轻轻摇晃，摇头道：“那家伙能不能活下来，还不好说，万一只等到一具尸体，多恶心。他陈平安没爹没娘的，如今连好朋友也死翘翘了，那可不就是得由我这个邻居，来给他处理后事？”
en_us: The roads became uneven after leaving Fortune Street, and Song Jixin's body started to lightly bounce up and down along with the movements of the carriage. He shook his head and replied, "It's hard to say if he can even live. If I'm greeted by a corpse after waiting for a long time, just how revolting will that be? Even his good friend has died, so at that time, won't it be left to me, his neigbor, to help him arrange a funeral?"

source: 骄傲的少女。
en_us: The prideful young woman and the obedient flying sword presented a rather odd pair.

source: 骤然间老人一声怒喝，如舌绽春雷，双脚好似一滑，高大身影便来到锦衣少年身前，老人后背轻轻一靠，以巧劲将少年推在小巷墙壁上，同时左手张开五指。
en_us: "Insolence!" the old man abruptly roared, and his furious voice rang out like an explosive thunderclap as his feet seemingly slid along the ground, instantly bringing him directly in front of the brocade-robed boy. He then leaned back gently to press the boy delicately against the wall of the alley wihle simultaneously spreading open the fingers of his left hand.

source: 骤然间，单薄木板床支撑不住刘羡阳的重量，从中断成两半，高大少年一屁股坐在地面上。
en_us: All of a sudden, the thin plank bed snapped in half down the middle, unable to support Liu Xianyang's weight any longer, and he sat heavily down onto the ground.
